In [1]:
import pandas as pd

In [8]:
df = pd.read_csv(r'C:\Users\Grace\Desktop\python\Python_Sample_Data.csv')
print(df)
print(df.head(5))

    ID     Name  Age         City  Salary
0    1    Grace   52      Houston   51976
1    2    David   31     New York   74262
2    3   Hannah   34      Houston   53776
3    4     Emma   53  Los Angeles   60080
4    5    Grace   57     New York   96842
5    6    Julia   21        Miami   91373
6    7  Charlie   19      Chicago   36776
7    8    Grace   23      Houston   85016
8    9   Hannah   59      Chicago   39474
9   10     Emma   21      Chicago   88053
10  11    David   46     New York   51959
11  12   Hannah   35      Chicago   35530
12  13   Hannah   43        Miami   33748
13  14  Charlie   51      Chicago   43545
14  15    Frank   27     New York   96199
15  16     Emma   53        Miami   64766
16  17      Bob   31  Los Angeles   91087
17  18   Hannah   48      Chicago   98840
18  19    Frank   32     New York   84384
19  20      Bob   25  Los Angeles   81005
20  21     Emma   31  Los Angeles   76576
21  22    Alice   40      Houston   69353
22  23    Julia   57        Miami   92003
23  24    Frank   38      Chicago   82733
24  25      Ian   33     New York   95318
25  26    Alice   35      Houston   53664
26  27    Julia   41        Miami   97172
27  28  Charlie   43      Houston   56736
28  29    Grace   42        Miami   30854
29  30    David   58        Miami   68623
30  31      Ian   46      Chicago   37392
31  32  Charlie   32        Miami   85680
32  33     Emma   18      Houston   76717
33  34  Charlie   42        Miami   80859
34  35    Grace   24      Chicago   56309
35  36     Emma   26      Chicago   93734
36  37      Ian   41      Houston   82662
37  38    Grace   18  Los Angeles   42688
38  39      Bob   25  Los Angeles   55342
39  40    David   41        Miami   67157
40  41      Ian   28     New York   97863
41  42      Bob   34        Miami   82083
42  43    Julia   25      Houston   95733
43  44      Ian   52      Houston   64698
44  45    Julia   52      Houston   52671
45  46     Emma   50      Houston   55184
46  47      Bob   22      Houston   72107
47  48    David   59      Chicago   81663
48  49    Grace   56  Los Angeles   45708
49  50   Hannah   58      Houston   79811
   ID    Name  Age         City  Salary
0   1   Grace   52      Houston   51976
1   2   David   31     New York   74262
2   3  Hannah   34      Houston   53776
3   4    Emma   53  Los Angeles   60080
4   5   Grace   57     New York   96842

In [ ]:
#Age is great than 30
filtered_df = df[df['Age'] > 30]
print(filtered_df)

    ID     Name  Age         City  Salary
0    1    Grace   52      Houston   51976
1    2    David   31     New York   74262
2    3   Hannah   34      Houston   53776
3    4     Emma   53  Los Angeles   60080
4    5    Grace   57     New York   96842
8    9   Hannah   59      Chicago   39474
10  11    David   46     New York   51959
11  12   Hannah   35      Chicago   35530
12  13   Hannah   43        Miami   33748
13  14  Charlie   51      Chicago   43545
15  16     Emma   53        Miami   64766
16  17      Bob   31  Los Angeles   91087
17  18   Hannah   48      Chicago   98840
18  19    Frank   32     New York   84384
20  21     Emma   31  Los Angeles   76576
21  22    Alice   40      Houston   69353
22  23    Julia   57        Miami   92003
23  24    Frank   38      Chicago   82733
24  25      Ian   33     New York   95318
25  26    Alice   35      Houston   53664
26  27    Julia   41        Miami   97172
27  28  Charlie   43      Houston   56736
28  29    Grace   42        Miami   30854
29  30    David   58        Miami   68623
30  31      Ian   46      Chicago   37392
31  32  Charlie   32        Miami   85680
33  34  Charlie   42        Miami   80859
36  37      Ian   41      Houston   82662
39  40    David   41        Miami   67157
41  42      Bob   34        Miami   82083
43  44      Ian   52      Houston   64698
44  45    Julia   52      Houston   52671
45  46     Emma   50      Houston   55184
47  48    David   59      Chicago   81663
48  49    Grace   56  Los Angeles   45708
49  50   Hannah   58      Houston   79811

In [ ]:
#calculate the average salary
average_salary = df['Salary'].mean()
print(f"The average salary is: {average_salary}")

The average salary is: 69755.68

In [11]:
# Add a new column for 10% bonus on salary
df['Bonus'] = df['Salary'] * 0.10

# Export the updated DataFrame to a CSV file
df.to_csv(r'C:\Users\Grace\Desktop\python\Updated_Data_with_Bonus.csv', index=False)

print("New column 'Bonus' added and results exported to CSV.")

New column 'Bonus' added and results exported to CSV.

In [ ]:
# calculate the minimum and maximum salary
min_salary = df['Salary'].min()
max_salary = df['Salary'].max()

print(f"The minimum salary is: {min_salary}")
print(f"The maximum salary is: {max_salary}")

The minimum salary is: 30854
The maximum salary is: 98840

In [ ]:
# calculate the number of unique cities
unique_cities_count = df['City'].nunique()
print(f"The number of unique cities is: {unique_cities_count}")

The number of unique cities is: 5

In [14]:
# Sort the DataFrame by age in descending order
df_sorted_by_age = df.sort_values(by='Age', ascending=False)
print(df_sorted_by_age)

    ID     Name  Age         City  Salary   Bonus
47  48    David   59      Chicago   81663  8166.3
8    9   Hannah   59      Chicago   39474  3947.4
49  50   Hannah   58      Houston   79811  7981.1
29  30    David   58        Miami   68623  6862.3
4    5    Grace   57     New York   96842  9684.2
22  23    Julia   57        Miami   92003  9200.3
48  49    Grace   56  Los Angeles   45708  4570.8
15  16     Emma   53        Miami   64766  6476.6
3    4     Emma   53  Los Angeles   60080  6008.0
44  45    Julia   52      Houston   52671  5267.1
43  44      Ian   52      Houston   64698  6469.8
0    1    Grace   52      Houston   51976  5197.6
13  14  Charlie   51      Chicago   43545  4354.5
45  46     Emma   50      Houston   55184  5518.4
17  18   Hannah   48      Chicago   98840  9884.0
30  31      Ian   46      Chicago   37392  3739.2
10  11    David   46     New York   51959  5195.9
12  13   Hannah   43        Miami   33748  3374.8
27  28  Charlie   43      Houston   56736  5673.6
33  34  Charlie   42        Miami   80859  8085.9
28  29    Grace   42        Miami   30854  3085.4
26  27    Julia   41        Miami   97172  9717.2
39  40    David   41        Miami   67157  6715.7
36  37      Ian   41      Houston   82662  8266.2
21  22    Alice   40      Houston   69353  6935.3
23  24    Frank   38      Chicago   82733  8273.3
25  26    Alice   35      Houston   53664  5366.4
11  12   Hannah   35      Chicago   35530  3553.0
2    3   Hannah   34      Houston   53776  5377.6
41  42      Bob   34        Miami   82083  8208.3
24  25      Ian   33     New York   95318  9531.8
31  32  Charlie   32        Miami   85680  8568.0
18  19    Frank   32     New York   84384  8438.4
16  17      Bob   31  Los Angeles   91087  9108.7
1    2    David   31     New York   74262  7426.2
20  21     Emma   31  Los Angeles   76576  7657.6
40  41      Ian   28     New York   97863  9786.3
14  15    Frank   27     New York   96199  9619.9
35  36     Emma   26      Chicago   93734  9373.4
19  20      Bob   25  Los Angeles   81005  8100.5
42  43    Julia   25      Houston   95733  9573.3
38  39      Bob   25  Los Angeles   55342  5534.2
34  35    Grace   24      Chicago   56309  5630.9
7    8    Grace   23      Houston   85016  8501.6
46  47      Bob   22      Houston   72107  7210.7
5    6    Julia   21        Miami   91373  9137.3
9   10     Emma   21      Chicago   88053  8805.3
6    7  Charlie   19      Chicago   36776  3677.6
37  38    Grace   18  Los Angeles   42688  4268.8
32  33     Emma   18      Houston   76717  7671.7

In [15]:
df_sorted_by_age.to_csv('ages_descending.csv', index=False)
print("Data exported to 'ages_descending.csv'.")

Data exported to 'ages_descending.csv'.

In [16]:
#Group daa by city and calculate the average salary
average_salary_by_city = df.groupby('City')['Salary'].mean()
print(average_salary_by_city)

City
Chicago        63095.363636
Houston        67864.571429
Los Angeles    64640.857143
Miami          72210.727273
New York       85261.000000
Name: Salary, dtype: float64

In [17]:
# final file & merge all calculations
calculations = {
    'Metric': ['Average Salary', 'Minimum Salary', 'Maximum Salary', 'Unique Cities Count'],
    'Value': [average_salary, min_salary, max_salary, unique_cities_count]
}

# Convert the dictionary to a DataFrame
calculations_df = pd.DataFrame(calculations)

# Save the DataFrame to a CSV file
calculations_df.to_csv('final_assignment.csv', index=False)

print("All calculations have been saved to 'final_assignment.csv'.")

All calculations have been saved to 'final_assignment.csv'.

In [18]:
# Save the updated DataFrame with all changes to a detailed CSV file
df.to_csv('final_score.csv', index=False)

print("Detailed CSV file with all changes has been saved as 'final_score.csv'.")

Detailed CSV file with all changes has been saved as 'final_score.csv'.